## 결측치 제거 및 그룹 합계에서 조건에 맞는 값 찾아 출력
**주어진 데이터 중 basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, \
'city'와 'f2'을 기준으로 묶어 합계를 구하고, \
'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오**
* 데이터셋 : basic1.csv
* 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

##### 라이브러리 및 데이터 불러오기

In [1]:
import pandas as pd

df = pd.read_csv('../../dataset/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

## User Code

## Solution

##### f1컬럼 결측치 제거

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [3]:
df = df[~df['f1'].isnull()]
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69 entries, 1 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      69 non-null     object
 1   age     69 non-null     float64
 2   city    69 non-null     object
 3   f1      69 non-null     float64
 4   f2      69 non-null     int64
 5   f3      4 non-null      object
 6   f4      69 non-null     object
 7   f5      69 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 4.9+ KB

##### 그룹 합계 계산

In [4]:
df2 = df.groupby(['city','f2']).sum()
df2

           age     f1          f5
city f2
경기   0   720.4  833.0  943.944823
     1   696.0  670.0  657.241212
     2   239.0  311.0  362.300060
대구   0   387.0  527.0  183.199568
     1   217.6  235.0  241.333824
     2   140.0  211.0   79.667919
부산   0   331.0  389.0  284.371097
     1   188.7  315.0  299.270973
     2   -13.5   47.0   67.886373
서울   0   145.0  278.0  218.528577
     1   315.3  534.0  438.485010
     2    68.3  207.0  126.661135

##### 조건에 맞는 값 출력

In [5]:
#'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값
df2.iloc[0]

age    720.400000
f1     833.000000
f5     943.944823
Name: (경기, 0), dtype: float64

In [6]:
df2.iloc[0]['f1']

833.0

## Hint
* 그룹 합계

In [7]:
import pandas as pd
df = pd.DataFrame({'User': ['네모', '네모',
                              '세모', '세모'],
                   'Max Speed': [120., 240., 57., 41.]})
df

  User  Max Speed
0   네모      120.0
1   네모      240.0
2   세모       57.0
3   세모       41.0

In [8]:
df.groupby(['User']).sum()

      Max Speed
User
네모        360.0
세모         98.0